package com.demo.chooseprovincedemo.utils;

/**
 * Created by mengwei on 2017/5/15.
 */

public class AddressUtils {

    /**
     * 所有省份名称
     */
    public static String[] provinceName = new String[]{
            "山西","内蒙古","陕西","天津","山东","河北","河南","新疆","湖北","湖南","江苏",
            "宁夏","四川","安徽","福建","江西","甘肃","青海","广东","北京","台湾","香港",
            "澳门","贵州","云南","西藏","上海","浙江","辽宁","吉林","黑龙江","广西","海南","重庆"
    };
    /**
     * 所有省份Id
     */
    public static int[] provinceId = new int[]{
            109000238,109000380,109003078,109000022,109001499,109000043,109001674,109003404,
            109001868,109001997,109000887,109003372,109002520,109001133,109001273,109001377,
            109003206,109003319,109002147,109000001,109003521,109003522,109003523,109002741,
            109002842,109002996,109000865,109001020,109000502,109000631,109000709,109002309,
            109002447,109002476
    };

    /**
     * 山西省所有市名称
     */
    public static String[] shanxiName = new String[]{
            "太原","大同","阳泉","长治","晋城","朔州","晋中","运城","忻州","临汾","吕梁"
    };
    /**
     * 山西省所有市Id
     */
    public static int[] shanxiId = new int[]{
            109000239,109000251,109000264,109000271,109000286,109000294,109000302,109000315,109000330,109000346,109000365
    };
    /**
     * 山西太原名称
     */
    public static String[] shanxiTaiyuanName = new String[]{
            "市辖区","小店","迎泽","杏花岭","尖草坪","万柏林","晋源","清徐","阳曲","娄烦","古交"
    };
    /**
     * 山西太原Id
     */
    public static int[] shanxiTaiyuanId = new int[]{
            109000240,109000241,109000242,109000243,109000244,109000245,109000246,109000247,109000248,109000249,109000250
    };
    /**
     * 山西大同
     */
    public static String[] shanxiDatongName = new String[]{
            "市辖区","城区","矿区","南郊","新荣","阳高","天镇","广灵","灵丘","浑源","左云","大同"
    };
    /**
     * 山西大同
     */
    public static int[] shanxiDatongId = new int[]{
            109000252,109000253,109000254,109000255,109000256,109000257,109000258,109000259,109000260,109000261,109000262,109000263
    };
    /**
     * 山西阳泉
     */
    public static String[] shanxiYangquanName = new String[]{
            "市辖区","城区","矿区","郊区","平定","盂县"
    };
    /**
     * 山西阳泉
     */
    public static int[] shanxiYangquanId = new int[]{
            109000265,109000266,109000267,109000268,109000269,109000270
    };
    /**
     * 山西长治
     */
    public static String[] shanxiChangzhiName = new String[]{
            "市辖区","城区","郊区","长治","襄垣","屯留","平顺","黎城","壶关","长子","武乡","沁县","沁源","潞城"
    };
    /**
     * 山西长治
     */
    public static int[] shanxiChangzhiId = new int[]{
            109000272,109000273,109000274,109000275,109000276,109000277,109000278,109000279,109000280,109000281,109000282,109000283,109000284,109000285
    };
    /**
     * 山西晋城
     */
    public static String[] shanxiJinchengName = new String[]{
            "市辖区","城区","沁水","阳城","陵川","泽州","高平"
    };
    /**
     * 山西晋城
     */
    public static int[] shanxiJinchengId = new int[]{
            109000287,109000288,109000289,109000290,109000291,109000292,109000293
    };
    /**
     * 山西朔州
     */
    public static String[] shanxiShuozhouName = new String[]{
            "市辖区","朔城","平鲁","山阴","应县","右玉","怀仁"
    };
    /**
     * 山西朔州
     */
    public static int[] shanxiShuozhouId = new int[]{
            109000295,109000296,109000297,109000298,109000299,109000300,109000301
    };
    /**
     * 山西晋中
     */
    public static String[] shanxiJinzhongName = new String[]{
            "市辖区","榆次","榆社","左权","和顺","昔阳","寿阳","太谷","祁县","平遥","灵石","介休"
    };
    /**
     * 山西晋中
     */
    public static int[] shanxiJinzhongId = new int[]{
            109000303,109000304,109000305,109000306,109000307,109000308,109000309,109000310,109000311,109000312,109000313,109000314
    };
    /**
     * 山西运城
     */
    public static String[] shanxiYunchengName = new String[]{
            "市辖区","盐湖","临猗","万荣","闻喜","稷山","新绛","绛县","垣曲","夏县","平陆","芮城","永济","河津"
    };
    /**
     * 山西运城
     */
    public static int[] shanxiYunchengId = new int[]{
            109000316,109000317,109000318,109000319,109000320,109000321,109000322,109000323,109000324,109000325,109000326,109000327,109000328,109000329
    };
    /**
     * 山西忻州
     */
    public static String[] shanxiXinzhouName = new String[]{
            "市辖区","忻府","定襄","五台","代县","繁峙","宁武","静乐","神池","五寨","岢岚","河曲","保德","偏关","原平"   };
    /**
     * 山西忻州
     */
    public static int[] shanxiXinzhouId = new int[]{
            109000331,109000332,109000333,109000334,109000335,109000336,109000337,109000338,109000339,109000340,109000341,109000342,109000343,109000344,109000345    };
    /**
     * 山西临汾
     */
    public static String[] shanxiLinfenName = new String[]{
            "市辖区","尧都","曲沃","翼城","襄汾","洪洞","古县","安泽","浮山","吉县","乡宁","大宁","隰县","永和","蒲县","汾西","侯马","霍州"   };
    /**
     * 山西临汾
     */
    public static int[] shanxiLinfenId = new int[]{
            109000347,109000348,109000349,109000350,109000351,109000352,109000353,109000354,109000355,109000356,109000357,109000358,109000359,109000360,109000361,109000362,109000363,109000364    };
    /**
     * 山西吕梁
     */
    public static String[] shanxiLvliangName = new String[]{
            "市辖区","离石","文水","交城","兴县","临县","柳林","石楼","岚县","方山","中阳","交口","孝义","汾阳"   };
    /**
     * 山西吕梁
     */
    public static int[] shanxiLvliangId = new int[]{
            109000366,109000367,109000368,109000369,109000370,109000371,109000372,109000373,109000374,109000375,109000376,109000377,109000378,109000379    };
    /**
     * 内蒙古
     */
    public static String[] neimengguName = new String[]{
            "呼和浩特","包头","乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","乌兰察布","兴安","锡林郭勒","阿拉善"
    };
    /**
     * 内蒙古
     */
    public static int[] neimengguId = new int[]{
            109000381,109000392,109000403,109000408,109000422,109000432,109000441,109000456,109000465,109000478,109000485,109000498
    };
    /**
     * 内蒙古-呼和浩特
     */
    public static String[] neimengguHuhehaoteName = new String[]{
            "市辖区","新城","回民","玉泉","赛罕","土默特左旗","托克托","和林格尔","清水河","武川"
    };
    /**
     * 内蒙古-呼和浩特
     */
    public static int[] neimengguHuhehaoteId = new int[]{
            109000382,109000383,109000384,109000385,109000386,109000387,109000388,109000389,109000390,109000391
    };
    /**
     * 内蒙古-包头
     */
    public static String[] neimengguBaotouName = new String[]{
            "市辖区","东河","昆都仑","青山","石拐","白云矿","九原","土默特右旗","固阳","达尔罕茂明安联合旗"
    };
    /**
     * 内蒙古-包头
     */
    public static int[] neimengguBaotouId = new int[]{
            109000393,109000394,109000395,109000396,109000397,109000398,109000399,109000400,109000401,109000402
    };
    /**
     * 内蒙古-乌海
     */
    public static String[] neimengguWuhaiName = new String[]{
            "市辖区","海勃湾","海南","乌达"
    };
    /**
     * 内蒙古-乌海
     */
    public static int[] neimengguWuhaiId = new int[]{
            109000404,109000405,109000406,109000407
    };
    /**
     * 内蒙古-赤峰
     */
    public static String[] neimengguChifengName = new String[]{
            "市辖区","红山","元宝山","松山","阿鲁科尔沁旗","巴林左旗","巴林右旗","林西","克什克腾旗","翁牛特旗","喀喇沁旗","宁城","敖汉旗"
    };
    /**
     * 内蒙古-赤峰
     */
    public static int[] neimengguChifengId = new int[]{
            109000409,109000410,109000411,109000412,109000413,109000414,109000415,109000416,109000417,109000418,109000419,109000420,109000421
    };
    /**
     * 内蒙古-通辽
     */
    public static String[] neimengguTongliaoName = new String[]{
            "市辖区","科尔沁","科尔沁左翼中旗","科尔沁左翼后旗","开鲁","库伦旗","奈曼旗","扎鲁特旗","霍林郭勒"
    };
    /**
     * 内蒙古-通辽
     */
    public static int[] neimengguTongliaoId = new int[]{
            109000423,109000424,109000425,109000426,109000427,109000428,109000429,109000430,109000431
    };
    /**
     * 内蒙古-鄂尔多斯
     */
    public static String[] neimengguEerduosiName = new String[]{
            "东胜","达拉特旗","准格尔旗","鄂托克前旗","鄂托克旗","杭锦旗","乌审旗","伊金霍洛旗"
    };
    /**
     * 内蒙古-鄂尔多斯
     */
    public static int[] neimengguEerduosiId = new int[]{
            109000433,109000434,109000435,109000436,109000437,109000438,109000439,109000440
    };
    /**
     * 内蒙古-呼伦贝尔
     */
    public static String[] neimengguHulunbeierName = new String[]{
            "市辖区","海拉尔","阿荣旗","莫力达瓦达斡尔族自治","鄂伦春自治旗","鄂温克族自治旗","陈巴尔虎旗","新巴尔虎左旗","新巴尔虎右旗","满洲里","牙克石","扎兰屯","额尔古纳","根河"
    };
    /**
     * 内蒙古-呼伦贝尔
     */
    public static int[] neimengguHulunbeierId = new int[]{
            109000442,109000443,109000444,109000445,109000446,109000447,109000448,109000449,109000450,109000451,109000452,109000453,109000454,109000455
    };
    /**
     * 内蒙古-巴彦淖尔
     */
    public static String[] neimengguBayanzhuoerName = new String[]{
            "市辖区","临河","五原","磴口","乌拉特前旗","乌拉特中旗","乌拉特后旗","杭锦后旗"
    };
    /**
     * 内蒙古-巴彦淖尔
     */
    public static int[] neimengguBayanzhuoerId = new int[]{
            109000457,109000458,109000459,109000460,109000461,109000462,109000463,109000464
    };
    /**
     * 内蒙古-乌兰察布
     */
    public static String[] neimengguWulanchabuName = new String[]{
            "市辖区","集宁","卓资","化德","商都","兴和","凉城","察哈尔右翼前旗","察哈尔右翼中旗","察哈尔右翼后旗","四子王旗","丰镇"
    };
    /**
     * 内蒙古-乌兰察布
     */
    public static int[] neimengguWulanchabuId = new int[]{
            109000466,109000467,109000468,109000469,109000470,109000471,109000472,109000473,109000474,109000475,109000476,109000477
    };
    /**
     * 内蒙古-兴安
     */
    public static String[] neimengguXinganName = new String[]{
            "乌兰浩特","阿尔山","科尔沁右翼前旗","科尔沁右翼中旗","扎赉特旗","突泉"
    };
    /**
     * 内蒙古-兴安
     */
    public static int[] neimengguXinganId = new int[]{
            109000479,109000480,109000481,109000482,109000483,109000484
    };
    /**
     * 内蒙古-锡林郭勒
     */
    public static String[] neimengguXilinguoleName = new String[]{
            "二连浩特","锡林浩特","阿巴嘎旗","苏尼特左旗","苏尼特右旗","东乌珠穆沁旗","西乌珠穆沁旗","太仆寺旗","镶黄旗","正镶白旗","正蓝旗","多伦"
    };
    /**
     * 内蒙古-锡林郭勒
     */
    public static int[] neimengguXilinguoleId = new int[]{
            109000486,109000487,109000488,109000489,109000490,109000491,109000492,109000493,109000494,109000495,109000496,109000497
    };
    /**
     * 内蒙古-阿拉善
     */
    public static String[] neimengguAlashanName = new String[]{
            "阿拉善左旗","阿拉善右旗","额济纳旗"
    };
    /**
     * 内蒙古-阿拉善
     */
    public static int[] neimengguAlashanId = new int[]{
            109000499,109000500,109000501
    };
    /**
     * 陕西
     */
    public static String[] shanbeiName = new String[]{
            "西安","铜川","宝鸡","咸阳","渭南","延安","汉中","榆林","安康","商洛"
    };
    /**
     * 陕西
     */
    public static int[] shanbeiId = new int[]{
            109003079,109003094,109003100,109003114,109003130,109003143,109003158,109003171,109003185,109003197
    };
    /**
     * 陕西-西安
     */
    public static String[] shanbeiXianName = new String[]{
            "市辖区","新城","碑林","莲湖","灞桥","未央","雁塔","阎良","临潼","长安","蓝田","周至","户县","高陵"
    };
    /**
     * 陕西-西安
     */
    public static int[] shanbeiXianId = new int[]{
            109003080,109003081,109003082,109003083,109003084,109003085,109003086,109003087,109003088,109003089,109003090,109003091,109003092,109003093
    };
    /**
     * 陕西-铜川
     */
    public static String[] shanbeiTongchuanName = new String[]{
            "市辖区","王益","印台","耀州","宜君"
    };
    /**
     * 陕西-铜川
     */
    public static int[] shanbeiTongchuanId = new int[]{
            109003095,109003096,109003097,109003098,109003099
    };
    /**
     * 陕西-宝鸡
     */
    public static String[] shanbeiBaojiName = new String[]{
            "市辖区","渭滨","金台","陈仓","凤翔","岐山","扶风","眉县","陇县","千阳","麟游","凤县","太白"
    };
    /**
     * 陕西-宝鸡
     */
    public static int[] shanbeiBaojiId = new int[]{
            109003101,109003102,109003103,109003104,109003105,109003106,109003107,109003108,109003109,109003110,109003111,109003112,109003113
    };
    /**
     * 陕西-咸阳
     */
    public static String[] shanbeiXianyangName = new String[]{
            "市辖区","秦都","杨凌","渭城","三原","泾阳","乾县","礼泉","永寿","彬县","长武","旬邑","淳化","武功","兴平"
    };
    /**
     * 陕西-咸阳
     */
    public static int[] shanbeiXianyangId = new int[]{
            109003115,109003116,109003117,109003118,109003119,109003120,109003121,109003122,109003123,109003124,109003125,109003126,109003127,109003128,109003129
    };
    /**
     * 陕西-渭南
     */
    public static String[] shanbeiWeinanName = new String[]{
            "市辖区","临渭","华县","潼关","大荔","合阳","澄城","蒲城","白水","富平","韩城","华阴"
    };
    /**
     * 陕西-渭南
     */
    public static int[] shanbeiWeinanId = new int[]{
        109003131,109003132,109003133,109003134,109003135,109003136,109003137,109003138,109003139,109003140,109003141,109003142
    };
    /**
     * 陕西-延安
     */
    public static String[] shanbeiYananName = new String[]{
            "市辖区","宝塔","延长","延川","子长","安塞","志丹","吴旗","甘泉","富县","洛川","宜川","黄龙","黄陵"
    };
    /**
     * 陕西-延安
     */
    public static int[] shanbeiYananId = new int[]{
            109003144,109003145,109003146,109003147,109003148,109003149,109003150,109003151,109003152,109003153,109003154,109003155,109003156,109003157
    };
    /**
     * 陕西-汉中
     */
    public static String[] shanbeiHanzhongName = new String[]{
            "市辖区","汉台","南郑","城固","洋县","西乡","勉县","宁强","略阳","镇巴","留坝","佛坪"
    };
    /**
     * 陕西-汉中
     */
    public static int[] shanbeiHanzhongId = new int[]{
            109003159,109003160,109003161,109003162,109003163,109003164,109003165,109003166,109003167,109003168,109003169,109003170
    };
    /**
     * 陕西-榆林
     */
    public static String[] shanbeiYulinName = new String[]{
            "市辖区","榆阳","神木","府谷","横山","靖边","定边","绥德","米脂","佳县","吴堡","清涧","子洲"
    };
    /**
     * 陕西-榆林
     */
    public static int[] shanbeiYulinId = new int[]{
            109003172,109003173,109003174,109003175,109003176,109003177,109003178,109003179,109003180,109003181,109003182,109003183,109003184
    };
    /**
     * 陕西-安康
     */
    public static String[] shanbeiAnkangName = new String[]{
            "市辖区","汉滨","汉阴","石泉","宁陕","紫阳","岚皋","平利","镇坪","旬阳","白河"
    };
    /**
     * 陕西-安康
     */
    public static int[] shanbeiAnkangId = new int[]{
            109003186,109003187,109003188,109003189,109003190,109003191,109003192,109003193,109003194,109003195,109003196
    };
    /**
     * 陕西-商洛
     */
    public static String[] shanbeiShangluoName = new String[]{
            "市辖区","商州","洛南","丹凤","商南","山阳","镇安","柞水"
    };
    /**
     * 陕西-商洛
     */
    public static int[] shanbeiShangluoId = new int[]{
            109003198,109003199,109003200,109003201,109003202,109003203,109003204,109003205
    };

}
